{
  "backend/main.mo": "Motoko canister defining resume data types, access control, recruiter visit logging, visitor messages, skills, content storage, and user profile methods with password- and role-gated operations.",
  "feature_evidence.json": "Feature evidence report listing required frontend and backend changes related to password-gated owner panel operations and authorization fixes.",
  "frontend-file-summaries.txt": "Text file containing prewritten 1–2 sentence summaries for all major frontend source files.",
  "frontend/.env.hatem23": "Environment variables configuring the Hatem23 deployment’s app name and owner name.",
  "frontend/index.css": "Tailwind base layer with OKLCH color tokens and dark mode variables applied globally.",
  "frontend/index.html": "HTML entry point that sets the page title to Hatem23 and loads the React app root and main script.",
  "frontend/README-Hatem23-deployment.md": "Documentation describing environment variables, build steps, backend separation, and deployment behavior for the Hatem23 clone.",
  "frontend/src/App.tsx": "Main React component that loads backend content, enforces recruiter prompt, renders all resume sections, and manages the owner panel modal.",
  "frontend/src/appConfig.ts": "Exports deployment-specific app configuration derived from environment variables with fallbacks.",
  "frontend/src/components/OwnerPanel/CertificationsEditor.tsx": "UI component for adding, editing, expanding, and deleting certification entries with confirmation dialogs.",
  "frontend/src/components/OwnerPanel/ContentEditor.tsx": "Main editor for website content, loading data, managing draft state, and saving updates across multiple sub-editors.",
  "frontend/src/components/OwnerPanel/EducationEditor.tsx": "Editor component that allows adding, modifying, expanding, and removing education items with delete confirmation.",
  "frontend/src/components/OwnerPanel/ExperienceEditor.tsx": "Handles creation, editing, expansion, and deletion of job experience entries with confirmation dialogs.",
  "frontend/src/components/OwnerPanel/HobbiesEditor.tsx": "Simple interface for listing, adding, and deleting hobby strings with confirmation prompts.",
  "frontend/src/components/OwnerPanel/OwnerAccessPanel.tsx": "Controls password-gated access to owner tools and navigation between administrative views like content editing and visitor data.",
  "frontend/src/components/OwnerPanel/ProjectsEditor.tsx": "UI for adding, editing, expanding, and deleting projects within owner content.",
  "frontend/src/components/OwnerPanel/RecruiterVisitsView.tsx": "Displays recruiter visit logs with options to clear all and handles loading and auth errors.",
  "frontend/src/components/OwnerPanel/SkillsEditor.tsx": "Manages adding, editing, deleting, and clearing skill entries with backend mutations.",
  "frontend/src/components/OwnerPanel/VisitorMessagesView.tsx": "Shows visitor messages sorted by timestamp with support for clearing and error handling.",
  "frontend/src/components/ProjectsSection.tsx": "Public-facing project list with expandable details and optional external links.",
  "frontend/src/components/RecruiterPromptModal.tsx": "Modal asking visitors if they're recruiters and logs visit metadata before proceeding.",
  "frontend/src/components/SecretMessageBox.tsx": "Empty placeholder component.",
  "frontend/src/components/SecretOwnerAccess.tsx": "Empty placeholder component.",
  "frontend/src/components/Section.tsx": "Animated section wrapper using IntersectionObserver to reveal content on scroll.",
  "frontend/src/components/TopNav.tsx": "Fixed top navigation that highlights active section and supports smooth scrolling.",
  "frontend/src/components/VisitorMessageForm.tsx": "Contact form that submits visitor messages via backend actor and shows success feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Hook to check if the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useContent.ts": "Hooks to fetch and update site content through the backend actor with password protection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Hooks for secret messages (placeholder) and skill management with backend password-protected mutations.",
  "frontend/src/hooks/useRecruiterVisit.ts": "Hooks to log recruiter visits and manage recruiter visit records via authenticated actor.",
  "frontend/src/hooks/useVisitorMessages.ts": "Hooks to submit, fetch, and clear visitor messages with backend integration.",
  "frontend/src/index.css": "Tailwind CSS config with custom color variables, dark mode settings, and utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/resumeContent.ts": "Exports a structured resume content object containing hero info, education, experience entries, skills, and certifications used to populate the resume site.",
  "frontend/src/utils/ownerAccess.ts": "Empty placeholder file for owner-access utilities.",
  "frontend/src/utils/ownerPanelAccess.ts": "Defines and exports the hardcoded owner panel password used for admin access.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Holds the project’s specification, architecture notes, known issues, and existing features for the resume site clone named Hatem23."
}