{
  "backend/main.mo": "Motoko backend providing authorization-gated user profiles, public logging of recruiter visits and visitor messages, public content retrieval, and password‑protected content updates.",
  "feature_evidence.json": "Feature evidence report listing files and components involved in implementing clear‑log controls for owner panel logs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, theme variables, and global styling for light and dark modes.",
  "frontend/index.html": "Root HTML document loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main React app rendering hero, resume sections, recruiter prompt, visitor message form, projects, and owner panel based on backend content.",
  "frontend/src/components/OwnerPanel/ContentEditor.tsx": "Owner panel editor allowing password‑gated updates to site content with fields for hero text, skills, hobbies, and project management.",
  "frontend/src/components/OwnerPanel/OwnerAccessPanel.tsx": "Password-gated owner panel that unlocks views for recruiter visits, visitor messages, and content editing, with query invalidation on login.",
  "frontend/src/components/OwnerPanel/ProjectsEditor.tsx": "Provides UI to add, remove, expand, and edit individual projects within the site's editable content.",
  "frontend/src/components/OwnerPanel/RecruiterVisitsView.tsx": "Displays recruiter visit logs, supports clearing all logs, and handles loading and authorization states.",
  "frontend/src/components/OwnerPanel/VisitorMessagesView.tsx": "Shows visitor messages sorted by time, with options to clear all and error/loading handling.",
  "frontend/src/components/ProjectsSection.tsx": "Renders the public projects list with expandable detail sections and optional external links.",
  "frontend/src/components/RecruiterPromptModal.tsx": "Prompts users to identify as recruiters and logs recruiter visits before continuing.",
  "frontend/src/components/SecretMessageBox.tsx": "Empty file with no implemented content.",
  "frontend/src/components/SecretOwnerAccess.tsx": "Empty file with no implemented content.",
  "frontend/src/components/Section.tsx": "Animated section wrapper that reveals content on scroll using IntersectionObserver.",
  "frontend/src/components/TopNav.tsx": "Top navigation bar that highlights active sections and smooth-scrolls to page anchors.",
  "frontend/src/components/VisitorMessageForm.tsx": "Contact form component that submits visitor messages and displays a confirmation state.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Hook that checks whether the current caller is an admin using the actor.",
  "frontend/src/hooks/useContent.ts": "Hooks for fetching and updating editable site content through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, persistence, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hooks for secret message operations, currently returning empty or error states.",
  "frontend/src/hooks/useRecruiterVisit.ts": "Hooks for logging recruiter visits and managing recruiter visit records via the actor.",
  "frontend/src/hooks/useVisitorMessages.ts": "Hooks for submitting, retrieving, and clearing visitor messages through the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables and utility classes for the site theme.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/resumeContent.ts": "Provides structured resume data including hero info, education, multiple experience entries, skills, and certifications.",
  "frontend/src/utils/ownerAccess.ts": "Empty file placeholder for owner-access utilities.",
  "frontend/src/utils/ownerPanelAccess.ts": "Exports a constant defining the owner panel password.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Describes the project’s current spec, architecture notes, known issues, and existing feature definitions."
}