{
  "backend/main.mo": "Motoko backend actor defining content, skills, recruiter visit logging, visitor messages, user profiles, and access‑controlled CRUD APIs using AccessControl and MixinAuthorization.",
  "backend/migration.mo": "Migration module that drops the old ownerPassword field and returns an empty upgraded actor state.",
  "feature_evidence.json": "Feature‑evidence report listing features, related files, components, and test IDs for deployment cloning and app‑name updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend components, hooks, utilities, and styles.",
  "frontend/.env.hatem23": "Environment file defining app name and owner name for the Hatem23 deployment.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color tokens, dark mode variables, and base styling rules.",
  "frontend/index.html": "HTML entry file setting document title to Hatem23 and mounting the React root.",
  "frontend/README-Hatem23-deployment.md": "Documentation explaining build steps, environment variables, and backend separation for the Hatem23 deployment clone.",
  "frontend/src/App.tsx": "Main React app that sets the document title, runs recruiter‑prompt gating, loads backend content and skills, and renders all resume sections and contact details.",
  "frontend/src/appConfig.ts": "Loads deployment‑specific app and owner names from environment variables with defaults.",
  "frontend/src/components/OwnerPanel/CertificationsEditor.tsx": "Owner‑panel subeditor allowing add, edit, expand, and delete operations for certification items using local state and callbacks.",
  "frontend/src/components/OwnerPanel/ContentEditor.tsx": "Main panel for editing site content, loading current data, managing draft state, and saving updates.",
  "frontend/src/components/OwnerPanel/EducationEditor.tsx": "Allows adding, editing, expanding, and deleting education entries with confirmation dialogs.",
  "frontend/src/components/OwnerPanel/ExperienceEditor.tsx": "Manages experience items, supporting creation, editing fields, expand/collapse, and deletion.",
  "frontend/src/components/OwnerPanel/HobbiesEditor.tsx": "Enables adding and removing hobby strings with delete confirmation.",
  "frontend/src/components/OwnerPanel/OwnerAccessPanel.tsx": "Provides password-gated owner panel navigation for viewing visits, messages, and editing content.",
  "frontend/src/components/OwnerPanel/ProjectsEditor.tsx": "Handles project list editing including adding, updating fields, expansion, and deletion.",
  "frontend/src/components/OwnerPanel/RecruiterVisitsView.tsx": "Displays recruiter visit logs with loading, error, formatting, and a clear-all function using confirmation dialog.",
  "frontend/src/components/OwnerPanel/SkillsEditor.tsx": "Provides UI to add, edit, and delete skills with mutation hooks and confirmation dialogs.",
  "frontend/src/components/OwnerPanel/VisitorMessagesView.tsx": "Shows visitor messages sorted by timestamp with clear-all functionality, loading states, and error handling.",
  "frontend/src/components/ProjectsSection.tsx": "Renders a list of projects with expandable details and optional external links.",
  "frontend/src/components/RecruiterPromptModal.tsx": "Prompts visitors to identify as recruiters and optionally provide company name, then logs the visit.",
  "frontend/src/components/SecretMessageBox.tsx": "Empty placeholder component.",
  "frontend/src/components/SecretOwnerAccess.tsx": "Empty placeholder component.",
  "frontend/src/components/Section.tsx": "Wraps content in a scroll-animated section using IntersectionObserver.",
  "frontend/src/components/TopNav.tsx": "Creates a scrolling top navigation bar that highlights the active section and supports smooth scrolling.",
  "frontend/src/components/VisitorMessageForm.tsx": "React form component that collects visitor name, email, and message and submits it via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides a query to check if the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useContent.ts": "Hooks to fetch and update site content through the backend actor with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, and stored identities via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for secret messages (placeholder), and CRUD operations for skills via the backend actor.",
  "frontend/src/hooks/useRecruiterVisit.ts": "Hooks to log recruiter visits, fetch visit logs, and clear them using the backend actor.",
  "frontend/src/hooks/useVisitorMessages.ts": "Hooks to submit, fetch, and clear visitor messages through the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining color variables, dark mode overrides, and utility classes for consistent styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/resumeContent.ts": "Static JSON-like object containing resume data including hero info, education, experience, skills, and certifications.",
  "frontend/src/utils/ownerAccess.ts": "Empty utility file with no implemented logic.",
  "frontend/src/utils/ownerPanelAccess.ts": "Exports a constant password string for owner panel access.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters from query or hash, persisting them in sessionStorage, and clearing them from the URL.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme colors, typography, animations, and plugins for styling the frontend.",
  "project_state.json": "Describes the project’s specification, architecture notes, known issues, and existing feature definitions for the resume website clone “Hatem23.”"
}