{
  "kind": "build_request",
  "title": "Fix owner panel authorization so contact info edits can be saved without admin access errors",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Fix the Owner Panel “Edit Website Content” save flow so editing Contact Information (address/location, phone number, email) does not fail with an authorization error after the owner has successfully unlocked the Owner Access Panel with password \"BirdOnTree3\".",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Whenever I try to change the contact info and the adress and the email it says it requires an admistrator access. Although I am in the adminstrator panel. fix that please"
        ]
      },
      "acceptanceCriteria": [
        "After unlocking the Owner Access Panel with the correct password, updating Contact Information fields in the Content Editor and clicking “Save Changes” succeeds with no “requires administrator access” / unauthorized error.",
        "The updated contact fields persist in the Motoko canister and remain updated after a page refresh.",
        "The public hero contact block reflects the updated contact fields after saving (following the app’s existing React Query refresh/invalidation behavior)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Update the backend to support password-gated owner write operations (at minimum: updating Content used by the site) so that the Owner Panel can update content without relying on Internet Identity admin permissions. The password to authorize these owner operations must be \"BirdOnTree3\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it says it requires an admistrator access. Although I am in the adminstrator panel"
        ]
      },
      "acceptanceCriteria": [
        "The backend exposes an owner-password-gated method for updating site content (including contact details) that succeeds when the correct password \"BirdOnTree3\" is provided and traps/returns an error when it is not.",
        "The existing public read method(s) (e.g., getContent) remain publicly accessible and unchanged in behavior.",
        "Saving content from the Owner Panel no longer depends on AccessControl admin permissions tied to the caller principal."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Wire the frontend Content Editor save logic to call the password-gated backend update method using the already-available unlocked password stored in the OwnerAccessPanel (passed into ContentEditor as the ownerPassword prop).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Although I am in the adminstrator panel. fix that please"
        ]
      },
      "acceptanceCriteria": [
        "When the OwnerAccessPanel is unlocked and navigates to the Content Editor, clicking “Save Changes” uses the unlocked password when calling the backend.",
        "If the Content Editor is rendered without an ownerPassword for any reason, the UI prevents saving and shows a clear English error message indicating owner access is required.",
        "The previous authorization error message about requiring administrator access is no longer shown during normal owner-panel saves with the correct password."
      ]
    }
  ],
  "constraints": [
    "Respect the Internet Computer single-actor backend architecture: all Motoko logic must remain in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Re-introducing Internet Identity gating for the Owner Access Panel.",
    "Adding any email-sending functionality.",
    "Changing the public recruiter prompt behavior or visitor message submission behavior beyond what is necessary to fix the owner content save authorization issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}