{
  "kind": "build_request",
  "title": "Clone existing resume app into a new separate deployment/domain named Hatem23",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Create a brand-new, separate application deployment (new project/canister/domain) named \"Hatem23\" by cloning/copying the entire current resume-site project so that the new deployment has the same functionality, UI, and backend behavior as the existing app.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "yes copy the whole project in a new domain that's all",
          "No the new domain Name should be Hatem23"
        ]
      },
      "acceptanceCriteria": [
        "A new, separately accessible deployment exists under the app/domain name \"Hatem23\".",
        "The existing/original app remains available and unchanged.",
        "The \"Hatem23\" deployment includes the same frontend pages/sections and the same backend capabilities (recruiter prompt logging, visitor messages, owner panel + CMS, projects, etc.)."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Ensure the \"Hatem23\" deployment has independent backend state from the original app (no shared persisted data), so that logs, messages, and CMS edits in one deployment do not appear in the other.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "yes copy the whole project in a new domain that's all"
        ]
      },
      "acceptanceCriteria": [
        "New recruiter visits, visitor messages, and CMS edits created in \"Hatem23\" do not affect or appear in the original app, and vice versa."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Update the cloned app’s visible app labeling/metadata to reflect the new app name \"Hatem23\" where applicable (for example, the HTML document title), while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-2"
        ],
        "quotes": [
          "No the new domain Name should be Hatem23"
        ]
      },
      "acceptanceCriteria": [
        "The cloned app’s browser tab/title displays \"Hatem23\" (or clearly includes \"Hatem23\").",
        "All user-facing UI text remains English."
      ]
    }
  ],
  "constraints": [
    "Do not rename or replace the existing/original app; create a separate cloned deployment.",
    "Keep all existing functionality/spec the same in the cloned \"Hatem23\" app unless explicitly requested otherwise.",
    "Respect the single-actor backend architecture (all Motoko logic remains in backend/main.mo).",
    "Do not modify any frontend files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not add any email-sending functionality (storing email as part of visitor submissions is allowed; sending is not)."
  ],
  "nonGoals": [
    "Adding new features beyond cloning/separating the deployment under the name \"Hatem23\".",
    "Changing the resume content, styling theme, or owner password behavior as part of the cloning (except for updating app labeling/metadata to \"Hatem23\")."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}