{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clone resume app frontend for separate Hatem23 deployment",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Add frontend-side configuration to support a separately deployable clone named Hatem23 without changing existing app behavior.",
      "acceptanceCriteria": [
        "A new, separately accessible deployment exists under the app/domain name \"Hatem23\".",
        "The existing/original app remains available and unchanged.",
        "The \"Hatem23\" deployment includes the same frontend pages/sections and the same backend capabilities (recruiter prompt logging, visitor messages, owner panel + CMS, projects, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/appConfig.ts",
          "operation": "create",
          "description": "Create a small app configuration module that centralizes deployment-specific metadata (e.g., app name) using build-time environment variables with sensible defaults for the Hatem23 clone."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new appConfig into the app so runtime labeling (e.g., document title) can be set based on the cloned deployment configuration while keeping all existing resume UI/sections and flows unchanged."
        },
        {
          "path": "frontend/.env.hatem23",
          "operation": "create",
          "description": "Add a deployment-specific environment file for the Hatem23 clone (e.g., VITE_APP_NAME) to support separate build/deploy configuration for the cloned frontend."
        },
        {
          "path": "frontend/README-Hatem23-deployment.md",
          "operation": "create",
          "description": "Document the frontend build-time settings needed for the Hatem23 clone (app name and any required canister/config values) to ensure the cloned deployment points to its own backend and remains separate from the original."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Update cloned app labeling/metadata to display the name Hatem23 while keeping all UI text in English.",
      "acceptanceCriteria": [
        "The cloned app’s browser tab/title displays \"Hatem23\" (or clearly includes \"Hatem23\").",
        "All user-facing UI text remains English."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML document title metadata so the browser tab/title clearly includes \"Hatem23\" while keeping the document language and user-facing text English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the app sets/maintains the document title at runtime using the centralized appConfig so the title reliably reflects \"Hatem23\" across navigations/refreshes without changing existing English UI copy."
        }
      ]
    }
  ]
}