{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Owner panel clear-all controls for Visitor Messages and Recruiter Visits",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Add owner-only clear-all actions with confirmation for Visitor Messages and Recruiter Visits, calling password-gated backend clear methods and refreshing the lists via React Query invalidation.",
      "acceptanceCriteria": [
        "VisitorMessagesView shows a \"Clear all messages\" button when the owner is viewing the Visitor Messages log.",
        "RecruiterVisitsView shows a \"Clear all visits\" button when the owner is viewing the Recruiter Visits log.",
        "Clicking a clear button prompts for confirmation (e.g., modal/dialog) with English text warning that the action cannot be undone and offering Cancel/Confirm actions.",
        "On confirm, the frontend calls the corresponding password-protected backend clear method using the already-unlocked owner password.",
        "After a successful clear, the relevant React Query cache is invalidated/refetched so the list becomes empty without a page reload.",
        "If the backend returns an authorization error (wrong/expired password), the UI shows an error state consistent with the existing authorization error handling in these views."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useVisitorMessages.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook (e.g., useClearVisitorMessages) that calls the backend clearVisitorMessages(password) capability and invalidates/refetches visitor-messages queries (including password-scoped query keys) so the list updates immediately after a successful clear."
        },
        {
          "path": "frontend/src/hooks/useRecruiterVisit.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook (e.g., useClearRecruiterVisits) that calls the backend clearRecruiterVisits(password) capability and invalidates/refetches recruiter-visits queries (including password-scoped query keys) so the list updates immediately after a successful clear."
        },
        {
          "path": "frontend/src/components/OwnerPanel/VisitorMessagesView.tsx",
          "operation": "modify",
          "description": "Add a \"Clear all messages\" control visible in the owner Visitor Messages log view. Implement a confirmation dialog/modal with English irreversible-action warning text and Cancel/Confirm actions. On Confirm, call the clear mutation using the already-unlocked ownerPassword prop, then invalidate/refetch so the UI becomes empty without reload. If the clear mutation errors with authorization, surface an error state consistent with the existing Authorization Error UI in this view."
        },
        {
          "path": "frontend/src/components/OwnerPanel/RecruiterVisitsView.tsx",
          "operation": "modify",
          "description": "Add a \"Clear all visits\" control visible in the owner Recruiter Visits log view. Implement a confirmation dialog/modal with English irreversible-action warning text and Cancel/Confirm actions. On Confirm, call the clear mutation using the already-unlocked ownerPassword prop, then invalidate/refetch so the UI becomes empty without reload. If the clear mutation errors with authorization, surface an error state consistent with the existing Authorization Error UI in this view."
        }
      ]
    }
  ]
}