{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Owner Panel password-gated content saving (frontend wiring + authorization error removal)",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Ensure Owner Panel contact info edits save successfully after owner unlock, persist across refresh, and update the public hero contact block without admin authorization errors.",
      "acceptanceCriteria": [
        "After unlocking the Owner Access Panel with the correct password, updating Contact Information fields in the Content Editor and clicking “Save Changes” succeeds with no “requires administrator access” / unauthorized error.",
        "The updated contact fields persist in the Motoko canister and remain updated after a page refresh.",
        "The public hero contact block reflects the updated contact fields after saving (following the app’s existing React Query refresh/invalidation behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useContent.ts",
          "operation": "modify",
          "description": "Update the content update mutation to accept and forward an owner password when saving content so contact field changes persist without relying on admin permissions."
        },
        {
          "path": "frontend/src/components/OwnerPanel/ContentEditor.tsx",
          "operation": "modify",
          "description": "Wire the save flow to pass the unlocked owner password into the content update mutation and normalize any legacy admin/authorization error text so successful owner saves do not show “requires administrator access”."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Wire Content Editor save logic to use the unlocked owner password from OwnerAccessPanel and block saving with a clear English error when ownerPassword is missing.",
      "acceptanceCriteria": [
        "When the OwnerAccessPanel is unlocked and navigates to the Content Editor, clicking “Save Changes” uses the unlocked password when calling the backend.",
        "If the Content Editor is rendered without an ownerPassword for any reason, the UI prevents saving and shows a clear English error message indicating owner access is required.",
        "The previous authorization error message about requiring administrator access is no longer shown during normal owner-panel saves with the correct password."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useContent.ts",
          "operation": "modify",
          "description": "Adjust the update-content hook API to require a password alongside Content, and call the backend update function with (newContent, password) to match the password-gated backend capability."
        },
        {
          "path": "frontend/src/components/OwnerPanel/OwnerAccessPanel.tsx",
          "operation": "modify",
          "description": "Ensure the unlocked password is passed through to ContentEditor via the existing ownerPassword prop (and avoid unsafe non-null assertions where the editor could render without a password)."
        },
        {
          "path": "frontend/src/components/OwnerPanel/ContentEditor.tsx",
          "operation": "modify",
          "description": "Make ownerPassword optional, disable/prevent saving when it is missing, and display a clear English error message indicating owner access is required; on save, include the ownerPassword in the update call."
        }
      ]
    }
  ]
}